Repository: maabou512/Trans_OSLS
Catalog: OSLS2017-level2.tmx
Source language: en_us
Languages: ja

source: Squaw Valley California did everybody get up here okay any travel issues at all wasn't as bad as last year we have a special announcement at the end of the vent about next year's location which be much more difficult place to get to it also tonight's evening reception don't forget to enjoy a mudslide we're going to be having those available for everyone too soon too soon all right well happy Valentine's Day everyone thank you also for spending your Valentine's Day with us yes yes as does mine but one of that we wanted you know as these this event evolved and next year we'll try not to put it on Valentine's Day but we do want
ja: ようこそカルフォルニアSquaw Valleyへ。みなさん泊まったとと思いますが問題はなかったですか（会場笑い）昨年よりは悪くなったでしょう。このイベントの最後に来年の開催地をアナウンスしますが、さらにたどり着くのが大変なところになります。みなさん参加できますので、夜のレセプションも忘れずに。マッドスライド（カクテル名）を楽しみましょう。まだ早い？（笑）あと、バレンタインデーですね、一緒に過ごしてくれてありがとう。このイベントは広げたいですが、来年度はバレンタインデーには当たらないようにしないといけませんね。

source: and reduce the number of n so we're combining some of events but I'm going to talk about that in a little bit one thing you might not know about the Linux Foundation is we do a lot of training we've trained over 800,000 students most of whom are take our training courses at no cost we are trying sure that the projects that we work with have a set of practitioners and developers that can further increase the adoption of that particular code not only that we have training programs that are trying to help the diversity in our communities both in terms of gender we offer free training scholarships for women's organizations all over the world we've also partnered with the goodwill in Austin Texas where we're working with people in poverty to give them job skills technical skills through our training curriculum and through a hands-on mentor program to lift those folks out of poverty single parents folks who've seen hard times folks who need good jobs a few of the things we're doing around training we're creating at the Linux Foundation we did a little tally across all the projects that just we're hosting about 14 billion dollars worth of value if you measure up the lines of code and how much it cost on average to create a line of code it's billions and billions of dollars worth of value and certainly Linux itself just continues to dominate almost every aspect of modern computing it runs almost all high performance computing systems the majority of mobile devices embedded systems most of the world's economy the internet it's safe to say runs on Linux so we're going to continue and we hope all of you join us and we know you're already working with us to on those big outcomes how can we really move the needle with shared open-source software to really make big impact on both industry and society and you know one of the things that I get asked about all the I'm is you know you're doing so much more than Linux when are you going to change Foundation and my response to that is I just made up like all these vests and gave them away to Africa pocket we're not change in pin Hagan at least that for now but no no name change but we really have gone beyond Linux some of you may be aware but many of you might not be aware that of work around security you're going to hear from Bruce Schneier in a minute here about a world that is facing increasing difficulty in trouble when it comes to cyber security privacy and other things we have an initiative Oh that we're working with here called let's encrypt there anyone here from the let's encrypt projects a few people
ja: one thing you might not know about the Linux Foundation is we do a lot of training we've trained over 800,000 students, most of whom are take our training courses at no cost. we are trying to make sure that the projects that we work with have a set of practitioners and developers that can further increase the adoption of that particular code. not only that we have training programs but we are trying to help the diversity in our communities both in terms of gender. we offer free training scholarships for women's organizations all over the world. we've also partnered with the Goodwill in Austin Texas where we're working with people in poverty to give them job skills technical skills through our training curriculum and through a hands-on mentor program to lift those folks out of poverty, single parents folks who've seen hard times, folks who need good jobs and those are a few of the things we're doing around training. 皆さんがLinux Foundationについてご存知ないことかもしれませんが、我々は80万人におよぶ人たちにトレーニングを提供しています。大半の人たちは無料のコースを取っています。我々と一緒に取り組むプロジェクトが個々のコードの採用が広がるよう、開発者（Developer）と実際に活用する人（Practitioner)の両方を得られることを確かにしようと努めています。トレーニングプログラムを提供するだけではなく、ジェンダーの観点からもコミュニティにおける多様性を手助けしています。世界中の女性団体に対し無償の奨学金を提供しており、またテキサス州AustinにあるGoodwillともパートナー関係を結び[*]、貧困下にある人たちにトレーニングカリキュラムやハンズオンのメンタープログラムを通じ職能としての技術スキルを提供し、シングルパレントやつらい状況にあったりよい仕事を必要としてたりする人たちが貧困から脱する取り組みをしています。これらは、トレーニングに関連で我々がしていることの一部です。 [*]Linux Foundation Partners with Goodwill to Offer Free Training and Lucrative Career Opportunities to Underserved Communities https://www.linuxfoundation.jp/news-media/announcements/2016/01/linux-foundation-partners-goodwill-offer-free-training-and we're (while?)creating at the Linux Foundation, we did a little tally across all the projects that just we're hosting about 14 billion dollars worth of value if you measure up the lines of code and how much it cost on average to create a line of code it's billions and billions of dollars worth of value. Linux Foundationでは創造的な活動をしているわけですが、ちょっとした勘定をしたところ、ホストしているすべてのプロジェクト横断でおよそ14Billion$の価値と値するという結果がでました。コードのライン数と一コードを生み出すの生じる平均コストから積み上げると、数十億ドルもの価値になるということです。 and certainly Linux itself just continues to dominate almost every aspect of modern computing it runs almost all high performance computing systems, the majority of mobile devices, embedded systems most of the world's economy the internet it's safe to say runs on Linux . so we're gonna continue and we hope all of you join us and we know you're already working with us to really focus on those big outcomes. how can we really move the needle with shared open-source software to really make big impact on both industry and society. たしかにLinuxそれ自身、実に近代のコンピューティングのほとんどすべての側面で優勢であるわけです。ハイパフォーマンスコンピューティングシステムほとんどすべて、モバイルデバイスのや組込みシステムの大多数で動いていますし、世界経済やインターネットのほとんどがLinux上で動いているといっても過言ではありません。私たちは進み続けていきます。そして、皆さんに参加していただきたいです。こういった成果（outcome）にフォーカスするべくすでに一緒に取組んでいるわけではありますが。産業や社会にインパクトを与えるには、共有されるオープンソース・ソフトウェアでどのように変化をもたらすことができるでしょうか？ and you know one of the things that I get asked about all the time is you know you're doing so much more than Linux when(why not) you are gonna change the name of the Linux Foundation and my response to that is I just made up like all these vests and gave(give?) them away if you want, we're not changing the name at least that for now .but... no no name change. but we really have gone beyond Linux. よく聞かれることの一つに、「Linux以外にも多くの取組みをしているなら、Linux Foundationという名前を変えないのか」という話がある。私の応えとしては、このベストを作ってしまいましたし、欲しい人にはお配りもしますので、変えるつもりはありません。少なくとも今のところは、変えません（笑）しかしながら、実際我々はLinuxを越えた活動をしていますね。 some of you may be aware but many of you might not be aware of that we are a lot of work around security you're going to hear from Bruce Schneier in a minute here about a world that is facing increasing difficulty in trouble when it comes to cyber security privacy and other things. we have an initiative or that we're working with here called let's encrypt. Is there anyone here from the let's encrypt projects? a few people,some folks. 何人かの方はご存知かもしれませんが、多くの人は我々がセキュリティ関連の取り組みを多くしている点をご存知ないかもしれません。この後でBruce Schneier[*]から今直面している、増加傾向にあるサイバーセキュリティやプライバシーといったことに関する問題について話を聞くことができると思います。我々が取り組んでいるイニシアチブに「Let's Encrypt!」があります。Let's encryptプロジェクトから来ている人はいますか？何人かいらっしゃいますね。 [*]Bruce Schneier https://en.wikipedia.org/wiki/Bruce_Schneier

source: encourage people to bring their family along I don't know if everyone was aware of this i hope it meets most of you were we have free childcare at the event this week we have lots and lots of parents who bought their children this week to the event including mine you may see my eight-year-old daughter running around but we really want to make this an event where people can come and enjoy themselves and the most important thing
ja: ただ、家族連れというのもいいかもしれませんね。存知ないかもしれませんが、今週のこのイベントではフリーチャイルドケアも用意していて、私を含めて多くの人がお子さんたちを連れてきています。私の8才の娘が走り回っているのを見た方がいるかもしれませんね。このイベントをたくさんの人が来て楽しめる場にしたいです。

source: of this event hopefully for all of you is that all of you will build better relationships with each other and to that end what I really encourage you to do this week is to get to know people who you don't know already this week we really this year's crowd is incredibly specially we have an amazing group of people from all aspects of open source you people who are leading open source program office people who are running and managing some of the biggest open source projects in the world folks who are deploying open source to billions and billions of subscribers in the telecom space people who are using open source to create production automobiles it's just all locks of open source are at this event this week and what we've done is structured our time so that there's lots of opportunity network to get to know each other we've emphasized the hallway track and I hope
ja: このイベントで大事なのは、みなさんがお互いによい関係を作っていく、ということでしょう。その目的にむかって、ぜひしてほしいと思うのは、いままで知らなった人と今週知り合いになってほしいということです。今年の参加者は、信じられないくらいスペシャルです。オープンソースのあらゆる切り口のグループの人たちが来ています。Open Source Program Officeを率いている人もいれば、世界最大のオープンソースプロジェクトをマネージしている人もいて、かたやテレコム領域で何10億人もの加入者向けにオープンソースをデプロイしている人もいれば、自動車向けにオープンソースを使う人もいます。まさにオープンソースの頼れる人たち（Rocks)がこのイベントに来ているということで、私たちはみなさんが知り合いになりネットワークができるよい機会となるようスケジュールを作りました。ぜひこの機会を活用してください。

source: some folks let's encrypt is a free certificate authority the idea behind let's encrypt is to make HTTP as the default for the Internet to secure all internet traffic by creating a free certificate authority this in 2016 for the first time ever more than fifty percent of internet traffic was secure in large part thanks to let's encrypt we can literally chart where let's encrypt started to when the move the needle started moving up in terms of secure traffic across the internet and we want to get that as high as we possibly can our core infrastructure initiative is working with projects that are sort of the intersection between incredibly important for the security integrity of the global Internet and kind of screwed up screwed up in terms of difficulty getting funding have a requirement for third-party audit need additional eyeballs on the code things like openssl ntpd other projects we're really that initiative is about creating a culture of secure coding practices for all open source projects and helping fix open source projects that haven't traditionally gotten resources but are important to society by providing them funding and other resources as well if you haven't seen the core infrastructure initiative badging program which has been adopted by some of biggest open source projects in the world check it out this is a way for your project to indicate that you follow secure coding practices have responsible disclosure policy have a more efficient way of making sure that security is part and parcel to everything you do in code in the networking sector we have lots of new open source projects and that's only getting bigger we're working with the largest global operators in the world you're going to hear this week from organizations like AT&T last year we partnered with China Mobile to announce a management orchestration platform they're essentially open sourcing the network infrastructure that provides service to billions of people all over the world we're doing a lot of good work to harmonize those projects you're going to hear about throughout this week in the cloud or cloud native computing foundation with a project such as Cooper Nettie's from me theists and others is really leading the way in terms of the modern micro service and container based application development methodology that that really is defining the way people build apps today Cloud Foundry another example of a platform that's being used to create incredibly important technology solutions for governments and organizations throughout the world our automotive Dan kouchi in the room maybe not i did see him at the bar late last night this is is such a sleeper project linux foundation that's going to have a huge impact just as more and more production vehicles roll out with the AGL code in it this is CES this year Daimler announced that they're joining our automotive grade Linux initiative so now we have Toyota daimler and a dozen of the world's biggest automotive OEMs all working together to create the future automotive middleware and informatics systems that really define what an automotive cockpit experience it looks like and then finally uh last year in December I think with pretty much there no we we rolled of work in December uh this month i think
ja: let's encrypt is a free certificate authority the idea behind let's encrypt is to make HTTP as the default for the Internet to secure all internet traffic by creating a free certificate authority. this in 2016 for the first time ever more than 50 percent of internet traffic was secure in large part thanks to let's encrypt we can literally chart where let's encrypt started to when the move, the needle started moving up in terms of secure traffic across the internet.and we want to get that as high as we possibly can. 「Let's Encrypt!」はフリーの認証局です。背景にあるアイデアは、インターネットのデフォルトであるHTTP接続を、フリーの認証局を作ることによってすべてセキュアなインターネットトラヒックにするということです。2016年インターネットトラヒックのうちセキュアなものが初めて50%を越えました。この大部分はLet's Encrypt!のおかげで、Let's Encryptがスタートしたところでインターネットを流れるセキュアなトラヒックの値が上に触れる図を示すことができます。我々としては、これをできる限り高いところに持っていきたいとところです。 our Core Infrastructure Initiative is working with projects that are a sort of the intersection between incredibly important to the security integrity of the global Internet and kind of screwed up, screwed up in terms of difficulty in getting funding, have a requirement for third-party audit, need additional eyeballs on the code things likeopenssl ntpd other projects. Core Infrastructure Initiativeは グローバルなインターネットで非常に高いセキュリティが重要となるところと資金を得られないなど「間違いが生じてしまった（Screwed-up）ところ」が交差するところにいるプロジェクトと一緒になった取組みをしています。OpenSSLやnptdその他プロジェクトで見られるように第三者監査を求めるプロジェクトもあれば、コードを見るより多くの目（eyeball)を必要とするプロジェクトもいます。 we're really that initiative is about creating a culture of secure coding practices for all open source projects and helping fix open source projects that haven't traditionally gotten resources but are important to society by providing them funding and other resources as well. 私たち、本イニシアチブでは全てのオープンソースプロジェクトでセキュアコーディングが実践される文化を創り出そうとしていて、社会にとって重要で、リソースを得ることができなかったオープンソースのプロジェクトにファンドやその他リソースを提供することで正しい方向に向かうことを支援しているのです。 if you haven't seen the core infrastructure initiative badging program which has been adopted by some of biggest open source projects in the world, check it out. this is a way for your project to indicate that you follow secure coding practices, have responsible disclosure policy, have a more efficient way of making sure that security is part and parcel to everything you do in code. Core Infrastructure Initiativeが提供していて、いくつかの世界最大規模のオープンソースプロジェクトで採用されているバッヂプログラム（Badging program)をもし見たことがないようでしたら、チェックしてみてください。これはみなさんのプロジェクトがセキュアコーディングを実践していて、情報開示ポリシー（disclosure policy）に責任があり、皆がコードを書くすべてについてセキュリティが最も大事であるということを確実にする効果的な方法がある、といったことを示すものになります。 in the networking sector we have lots of new open source projects and that's only getting bigger we're working with the largest global operators in the world you're going to hear this week from organizations like AT&T last year we partnered with China Mobile to announce a management orchestration platform they're essentially open sourcing the network infrastructure that provides service to billions of people all over the world we're doing a lot of good work to harmonize those projects you're going to hear about throughout this week in the cloud or cloud native computing foundation with a project such as Cooper Nettie's from me theists and others is really leading the way in terms of the modern micro service and container based application development methodology that that really is defining the way people build apps today Cloud Foundry another example of a platform that's being used to create incredibly important technology solutions for governments and organizations throughout the world our automotive Dan kouchi in the room maybe not i did see him at the bar late last night this is is such a sleeper project linux foundation that's going to have a huge impact just as more and more production vehicles roll out with the AGL code in it this is CES this year Daimler announced that they're joining our automotive grade Linux initiative so now we have Toyota daimler and a dozen of the world's biggest automotive OEMs all working together to create the future automotive middleware and informatics systems that really define what an automotive cockpit experience it looks like and then finally uh last year in December I think with pretty much there no we we rolled of work in December uh this month i think
